var Govs = [
    "محافظة كفر الشيخ",
    "محافظة الدقهلية",
    "محافظة الغربية",
    "محافظة البحيرة",
    "محافظة الإسكندرية",
    "محافظة دمياط",
    "محافظة المنوفية",
    "محافظة القاهرة",
    "محافظة الجيزة",
    "محافظة المنيا",
    "محافظة القليوبية",
    "محافظة الشرقية",
    "محافظة الفيوم",
    "محافظة مطروح",
    "محافظة الإسماعيلية",
    "محافظة بورسعيد",
    "محافظة السويس",
    "محافظة شمال سيناء",
    "محافظة جنوب سيناء",
    "محافظة سوهاج",
    "محافظة البحر الأحمر",
    "محافظة قنا",
    "محافظة أسوان",
    "محافظة بني سويف",
    "محافظة أسيوط",
    "محافظة الأقصر",
    "محافظة الوادي الجديد",
];
//KFS
var KFS = [
    "كفر الشيخ",
    "قسم كفر الشيخ",
    "بيلا",
    "دسوق",
    "قسم دسوق",
    "البرلس",
    "الجمايله",
    "الحامول",
    "الخبى",
    "الرياض",
    "الصوالحه",
    "الطابق",
    "ام سن الكبرى",
    "سيدى سالم",
    "شنو",
    "فوه",
    "قلين",
    "مطوبس"
];
// البرلس
var Broles = [
    " بلطيم ", "الربع ",
    "البنائين", " الحماد ",
    " الساحل القبلى", "الساحل البحرى ", "الشهابيه",
    "الشورى ", "الشيخ مبارك ", "العياش", "المقصبه ",
    "بر بحرى", "مسطروه "
];
// الرياض
var Ryad = [
    " 58 المجد ", "ابو ريه ",
    "ابو قايد", " ابو مصطفى ",
    " البريه", "البشاير ", "الحصفة",
    "الرصيف ", "الرغامه ", "الزقم", "السيد خليل ",
    "الشراقوه", "العاقوله ", "العباسية", "العمدان",
    "المثلث ", "الوزاريه", "ام القرى", "ام سن",
    "بقلولة", "بكر ", " فرج", "قرية الضبعة",
    "مدينة الرياض", "منشأة سلامة"
];
// الحاملول
var Elhamol = [
    "الابعاديه البحرية ", "ابو سكين ",
    "الابعاديه", " الاصلاح",
    " البنا", "الثمانين ", "الدياسطى",
    "الزاويه ", "الزعفران ", "السحايث", "السلاهيب ",
    "الطرفايه", "العنتراوى ", "القرن", "القليعه",
    "الكشاكوه ", "الكفر الشرقى", "المجاز الشرقى", "المناوفة",
    "النشاوى", "ايطاليا ", " حامول العرب", "تريان",
    "عزبة القرية", "عزبة زيدان", "عزبة سعد الجديدة"
    , "عزبة فتحية", "غرب المنصور", "غرب تيره", "قريه 7",
    "قطاع الحامول", "قطاع منصور", "كوم الحجر",
    "كوم شيخ العرب", "مدينة الحامول"
];
// الصوالحة
var Sowalh = ["القنطرة البيضاء"];
// بيلا
var byla = [
    "ابشان", "ابو بدوى",
    "ابو عساكر", " ابو مرزوق",
    " ابو مرزوق", "الجرايدة ", "الجزار",
    "الحمايده ", "الحوه ", "الخادمبة", "الزعفرانه ",
    "السامر", "الشرقاويه ", "الشطوط", "الترزي",
    "العشب ", "العلاميه", "الكراكات", "الكفر الشرقى",
    "الكوم الطويل", "المناومنة ", " الناصريه", "الهمه",
    "بازيد", "حازق", "حامول البراري"
    , "دار السلام", "سريوه الكبرى", "عزبة الجندى", "عزبة الديبة",
    "عزبة الماريا", "عزبة المباريات", "عزبة جورجى",
    "عزبه ابو شريف", "عزبه الجزارين", "عزبه اللواء",
    "عزبه غزال", "قرية روس الفرخ", "كفر الجرايده",
    "كفر العجمى", "كفر القته", "كوم الحجر", "كوم الحجنه",
    "مدينة بلال", "مدينة بيلا", "مضرب الجرن"
];
// دسوق
var Desouq = [
    "أبيوقا", "ابطو",
    "ابو مندور", " ارض مفتاح",
    " الأصينة", "الابراهمية ", "الجمايله",
    "الشباسيه ", "الشون ", "الصافيه", "العجوزين ",
    "الكرداوه", "الكشلة ", "المحموديه", "المندوره",
    "النوايجه ", "جماجون", "دمروسلمان", "دمنكه",
    "سنهور المدينة", "شابه ", " شباس الشهداء", "شباس الملح",
    "عزب الزوامل", "كفر أم يوسف", "كفر ابراهيم"
    , "كفر ابو زياده", "كفر الخير", "كفر السودان", "كفر العرب",
    "كفر عبدالرحمن", "كفر مجر", "كنيسه السرادوسى",
    "لاصيفر البلد", "محرم", "محلة ابو على",
    "محلة دياى", "محلة مالك", "منشأة بطاح",
    "منشأة على أغا", "منشأةزعلوك", "منية جناج"
];
// سيدي_سالم
var SidiSalm = [
    "ابو احمد", "ابو العزائم",
    "ابو عوض", " ابو عيد",
    " ابوعليوه الغربيه", "ابوعوف القن ", "ابوغانم",
    "ابوغنيمه ", "اصلاح شالما ", "اصلاح شالمه", "البدرى ",
    "البكاروه", "البلاصى ", "البهنساوى", "الحدادى",
    "الخوالد ", "الربايعه", "الروضة", "السبعين",
    "السنط الهندسيه", "السنط ", " الشخلوبه", "الصالحات",
    "العيسوية", "الفقهاء البحريه", "الفقهاء القبليه"
    , "القصابى", "القن", "القواسم", "المسيرى ابو احمد",
    "المفتى الكبرى", "الناظر", "الهندسة",
    "الورق", "برية لاصيفر", "بريد وكفريوسف",
    "دمرو الحدادى", "دمرو", "رزق جاويش",
    "سد خميس", "شالما", "شالمه", "شمس الدين ابواحمد",
    "تيده", "عزبة المسيرى", "عزبه الكوم", "عزبه ناصر",
    "عمران", "عين الشركة", "فرش بركات", "كفر المشارقه",
    "كوم الذهب", "مدينة سيدىسالم", "منشأةعقل", "منشأه عباس",
    "منشاة المصرى", "منشاه على", "منية عقل"
];
// فوه
var فوه = [
    "ابودراز", "الاصلاح البحرى",
    "الاصلاح القبلى", " الروضة",
    " الفتوح", "المنشية",
    "السالميه ", "سنديون ", "شمشيره", "عريان ",
    "قبريط", "مدينة فوة ", "ميت الاشراف"
];
// شنو
var Shno = ["رزقة الشناوى"];
//QsmDesouq
var QsmDesouq = ["مدينة دسوق"];
//QsmKFS
var قسم_كفر_الشيخ = [
    "سخـا","الشوادفى اللقانى", "الملحقات",
    "بديرعليوة", "على مصطفى الزواوى",
    "عوض الزواوى", "ميت علوان"
];
//Qlene
var Qlene = [
    "البكاتوش", "الشقة",
    "الغنيمى", "المنشأةالصغرى", "المنشأه الكبرى",
    "المنشلين", "بلنكومة", "حصه الغنيمى",
    "شباس عمير", "صروه", "طويلة نشرت", "عزبة الخبى",
    "عزبة جوده", "قريه 77", "قزمان", "قلين البلد",
    "قونه", "كفر ابوناعم", "كفر الجزائر", "كفر المرازقة",
    "كفر المراسله", "كفر المشايخ", "كفر يوسف حنس",
    "كفر يوسف داود", "مدينة قلين", "منشأة شبراطو",
    "منشأة عجلان", "منشأه الشاذلى", "منيه قلين",
    "ميت الديبه", "نشرت"
];
//كفر_الشيخ
var KFSCity = [
    "ابو طبل", "ابوتمادة",
    "ادريجه", "اريمون", "اسحاقه",
    "الاتحاد", "البخانيس", "الحدود",
    "الحفير", "الحلافى", "الحمراوى", "الحمرا",
    "الخادمية", "الخضيرى", "الرصيف", "الروضه",
    "الزاويه", "الزعفرانى", "الزعفران", "السرايا",
    "الشرفا", "الشمارقة", "الطايفه",
    "الطرابية", "القرضا", "الكفر الجديد",
    "المجد", "المرابعين", "المنشأة الكبرى",
    "اميوط", "النطاف", "اول كفرالشيخ",
    "بطيطة", "بلشاشه", "بلطيم", "ثان كفر الشيخ",
    "حليس", "دفريه", "دقلت", "دقميره", "دمنكه",
    "رزقةأماى", "رزقةالشناوى", "روينه", "سيدى غازى",
    "شنـو", "صندلا", "عزبة  السيد عطية", "عزبة شرمى",
    "عزبه البرنسه", "عزبه التفتيش", "عزبه حبيب",
    "عزبه خميس", "قراجه", "كفر ابو زياده",
    "كفر الطايفة",
    "كفر المرابعين", "كفر المنشىالبحرى",
    "كفر دفريه", "كفر عسكر", "كفر متبول",
    "محلة القصب", "محلة موسى", "مسير", "مصطفى(الطواحنة)",
    "متبول", "منشأة ناصر", "منشأةالصفا", "منشاة عقل",
    "منية مسير", "نصره"
];
// مطوبس
var motobs = [
    "ابيانه", "البراجه", "الجزيرة الخضراء",
    "القنى", "القومسيون شرق", "القومسيون غرب",
    "برج مغيزل", "برنبال", "بريدعة", "بنى بكار",
    "خان الجنى", "خليج قبلى", "عزب الخليج بحرى",
    "عزب الغرب", "عزبة قابل", "عزبه صبح",
    "عزبه عمرو", "مدينة مطوبس", "معدية مهدى",
    "معديه رشيد", "منيةالمرشد", "وقف بحرى", "وقف قبلى"
];
//  **********************************************************
//Alex
var Alex = [    
        "ادارة شرطة ميناء الاسكندريه", "ابوقير ",
        "ارض الخواجا ابراهيم", " ارض شاكوس ",
        " الازاريطة", "الانفوش ", "االبيطاش",
        "الجمرك ", "الدخليه ", "الرمل", "الابراهيمية ",
        "السيوف ترام", "السيوف ", "الشاطبي", "الصالحية الجديدة",
        "الظاهر ", "العامريه", "العجمي", "العطارين",
        "العوائد", "اللبان", "المحروسه الجديدة", "المندرة قبلي",
        "المنشيه", "المنتزه", "المواساه", "النهضة المسيري",
        "الورديان", "باب الشرق", "باكوس", "برج العرب", "بوكلس ",
        "جليم", "رشدى", "زيزينيا", "سموحة", "سبورتنج", "سيدي جابر ",
        "شرق الاسكندرية", "عبريال", "عربال", "فيكتوريا", "كرموز",
        "كمب شيزار", "محرم بيك", "مدينه النصر", "مدينه برج العرب الجديدة",
        "ميامي", "مينا تابصل",
    ];
//Behiera
var AlBeheera = [
    " ابو حمص ", "ابو المطامير ",
    "ادكو", " البذور ",
    " البركة", "الخطاطبة ", "الدلنجات",
    "السادات ", "المحموديه ", "المزرعة الالية", "الناصر ",
    "ايتاي البارود", "الهلباوي ", "حوش عيسي", "دمنهور",
    "سنورس البحريه ", "رشيد", "شبرخيت", "عزبة حداية",
    "غرب النوبارية", "قسم دمنهور ", " قسم كفر الدوار", "كفر الدوار",
    "كوم حماد", "كوم تروجي", "مديرية التحرير", "مركز بدر",
    "وادي النطرون"
];
//Mansoura
var Mansoura = [
    "أجا",
    "أول المنصورة",
    "أول طلخا",
    "الجمالية",
    "السنبلاوين",
    "المطرية",
    "المنزله",
    "المنصورة",
    "بلقاس",
    "بنى عبيد",
    "ثان المنصورة",
    "ثان طلخا",
    "دكرنس",
    "شربين",
    "طلخا",
    "تمى الامديد",
    "قسم جمصة",
    "قسم ميت غمر",
    "كفر البدماص",
    "محلة دمنه",
    "مركز المنصورة",
    "منية النصر",
    "ميت العامل",
    "ميت سلسيل",
    "ميت غمر",
    "نبروه"
];
//Tanta
var Tanta = [
    "ابو صير",
    "السنطه",
    "المحلة الكبرى",
    "اول المحلة",
    "اول طنطا",
    "بسيون",
    "ثالث المحلة الكبرى",
    "ثان المحلة الكبرى",
    "ثان المحلة",
    "ثان طنطا",
    "خامس المحله",
    "خياطة قطور",
    "رابع المحلة الكبرى",
    "زفتى",
    "سماتاى",
    "سمنود",
    "طنطا",
    "قطور",
    "كفر الزيات",
    "منية سمنود"
];
//Damita
var Damita = [
    "أول دمياط",
    "الزرقا",
    "دمياط الجديده",
    "دمياط",
    "فارسكور",
    "قسم دمياط",
    "قسم رأس البر",
    "كفر البطيخ",
    "كفر سعد",
    "ميناء دمياط الجديد"
];
//Monofia
var Monofia = [
    "اشمون",
    "الباجور",
    "السادات",
    "الشهداء",
    "اول شبين الكوم",
    "بركة السبع",
    "سرس الليان",
    "شبين الكوم",
    "تلا",
    "قسم مدينة منوف",
    "قويسنا",
    "منوف"
];
//Cairo
var Cairo = [
    "15مايو",
    "6 أكتوبر (محافظة القاهرة)",
    "الأزبكيه",
    "الاميريه",
    "البساتين",
    "الجمالية",
    "الخلفاوى",
    "الخليفة",
    "الدرب الأحمر",
    "الدقى",
    "الرحاب",
    "الزاوية الحمراء",
    "الزمالك",
    "الزهراء",
    "الزيتون",
    "الساحل",
    "السلام",
    "السيدة زينب",
    "الشرابيه",
    "الظاهر",
    "التبين",
    "العباسية",
    "العبور",
    "العقاد",
    "القاهرة الجديدة",
    "القبة 1",
    "القبة 2",
    "القبة أول",
    "القصر العينى",
    "المرج",
    "المطرية/2",
    "المطرية",
    "المعادى الجديدة",
    "المعادى",
    "المعصرة البلد",
    "الموسكى",
    "النزهة الجديدة",
    "النزهة",
    "الوايلي",
    "باب الشعرية",
    "بولاق",
    "ثان روض الفرج",
    "حدائق القبه",
    "حدائق حلوان",
    "حلوان(محافظة القاهرة)",
    "حلوان",
    "دار السلام",
    "روض الفرج",
    "شبرا مصر",
    "شبرا",
    "صقر قريش",
    "عابدين",
    "عين شمس",
    "قسم ثانى مدينة نصر",
    "قسم شرطة القاهرة الجديدة",
    "قسم طره",
    "قسم منشأة ناصر",
    "قصر النيل",
    "مدينة الامل",
    "مدينة بدر",
    "مدينة نصر",
    "مصر الجديدة",
    "مصر القديمة",
    "هليوبوليس"
];
//Giza
var Giza = [
    "6 أكتوبر",
    "اطفيح",
    "البدرشين",
    "الجيزه",
    "الحوامديه",
    "الدقى",
    "الصف",
    "العجوزة",
    "العمرانيه",
    "العياط",
    "المنيل",
    "المهندسين",
    "الهرم",
    "الوراق",
    "امبابه",
    "اوسيم",
    "بولاق الدكرور",
    "حي جنوب الجيزة",
    "قسم الواحات البحرية",
    "قسم الوراق",
    "قسم امبابة",
    "قسم مدينة 6أكتوبر",
    "كرداسه",
    "مدنى الجيزة",
    "منشأة القناطر"
];
//Menya
var Menya = [
    "ابو قرقاص",
    "العدوة",
    "المنيا",
    "المنيا",
    "بنى حسن",
    "بنى مزار",
    "دير مواس",
    "سمالوط",
    "قسم ملوى",
    "مدينة المنيا الجديدة",
    "مريوط",
    "مطاى",
    "مغاغه",
    "ملوى"
];
//Elqlyubia
var Elqlyubia = [
    "الخانكه",
    "الشرقاويه",
    "القناطر الخيرية",
    "اول شبرا الخيمه",
    "بنها",
    "ثان شبرا الخيمه",
    "شبرا الخيمة",
    "شبين القناطر",
    "طوخ",
    "عرب الحواله",
    "قسم الخصوص",
    "قسم العبور",
    "قسم بنها",
    "قسم قليوب",
    "قسم قها",
    "قليوب",
    "قويسنا",
    "كفر شكر"
];
//Elshrqya
var Elshrqya = [
    "ابن عاص",
    "ابو الشقوق",
    "ابو حماد",
    "ابو كبير",
    "الإبراهيميه",
    "الحسينيه",
    "الحوض الطويل",
    "الزقازيق",
    "الصالحيه",
    "العاشر من رمضان",
    "القنايات",
    "القرين",
    "اول الزقازيق",
    "اولاد صقر",
    "بلبيس",
    "بنى عيسى",
    "ثانى الزقازيق",
    "ديرب نجم",
    "سعود القبلية",
    "فاقوس" ,
    "قسم العاشر من رمضان ثان",
    "قسم فاقوس",
    "كفر صقر",
    "مشتول السوق",
    "منيا القمح",
    "ههيا"
];
//Fayum
var Fayum = [
    "ابشواى",
    "اطسا",
    "العامرية",
    "الفيوم",
    "بيهيمو",
    "سنورس",
    "سيلا",
    "طاميه",
    "قسم الفيوم",
    "مركز يوسف الصديق"
];
//Matroh
var Matroh = [
    "الحمام",
    "السلوم",
    "الضبعة",
    "سيدى برانى",
    "سيوه",
    "قسم مارينا العلمين السياحية",
    "مرسى مطروح"
];
//Esmalia
var Esmalia = [
    "الحمام",
    "السلوم",
    "الضبعة",
    "سيدى برانى",
    "سيوه",
    "قسم مارينا العلمين السياحية",
    "مرسى مطروح"
];
//PortSaied
var PortSaied = [
    "ادارة شرطة ميناء بورسعيد",
    "الجميل",
    "الزهور",
    "الشرق",
    "الضواحى",
    "التضامن",
    "العرب",
    "القابوطى ",
    "المناخ",
    "اول بورسعيد",
    "بحر البقر",
    "بورفؤاد",
    "ثان بورسعيد",
    "جزيرة ام خلف",
    "حى العرب",
    "حى الكويت",
    "رابع بورسعيد",
    "شرق بورسعيد",
    "قسم الجنوب",
    "قسم الزهور",
    "قسم المناصرة(غرب بورسعيد)",
    "قسم بور فؤاد ثانى",
    "قسم ثان الجنوب",
    "قسم مبارك(شرق التفريعة)",
    "ميت التضامن",
    "ناصر"
];
//Swize
var Swize = [
    "الأربعين",
    "الجناين",
    "الفرز",
    "المثلث",
    "عتاقة",
    "فيصل",
    "قسم السويس",
    "كفر ابوالعز",
    "كفر بن سلامة"
];
//NorthCina
var NorthCina = [
    "الشيخ زويد",
   "المساعيد",
   "العريش",
    "اول العريش",
    "بئر العبد" ,
    "ثالث العريش",
    "ثان العريش",
    "رفح",
    "رومانه",
    "غزه",
    "قاطيه",
    "قسم  شرطة القسيمة",
    "قسم رابع العريش",
    "قسم نخل",
    "مركز الحسنة"
];
//SouthCina
var SouthCina = [
   "ابو رديس",
   "الطور",
   "دهب",
   "رأس سدر",
   "سانت كاترين",
   "شرم الشيخ",
   "طور سيناء",
   "نويبع",
];
//Swhag
var Swhag = [
    "اخميم",
    "البلينا",
    "الجلاويه",
    "الشاوده",
    "العوامر قبلي",
    "المراغه",
    "المنشأه",
    "اولاد هامش",
    "جرجا",
    "جهينه",
    "دار السلام",
    "ساقلته",
    "سوهاج",
    "طما",
    "طهطا",
    "طوق شرق",
    "قسم الكوثر",
    "قسم اول سوهاج",
    "قسم ثان سوهاج",
    "قسم طهطا",
    "قسم مدينة جرجا",
    "مركز العسيرات",
    "نزه الهيش"
    ];
//Read Sea
var ReadSea = [
    "الغردقة",
    "القصير",
    "رأس غارب",
    "سفاجا",
    "قسم الشلاتين",
    "قسم حلايب",
    "قسم مرسى علم"
];
//Qna
var Qna = [
    "ابو تشت",
    "اسنـا",
    "الأقصر",
    "الحبيل",
    "الحميدات",
    "القرنه",
    "المنشه الجديده",
    "الوقف",
    "دشنا",
    "فرشوط",
    "قسم قنا",
    "قفط",
    "قنـا",
    "قوص",
    "نجع حمادى",
    "نقاده"
];
// Aswan
var aswan = [
    "ادفو",
    "ارض يعقوب",
    "اسوان",
    "الحصايا",
    "السيل الجديد",
    "السيل الريفى",
    "النجع البحرى",
    "النوبه",
    "بينان قبلى",
    "كوم أمبو",
    "كيما",
    "مدينة نصر",
    "مدينة نصر",
    "مركز أبو سمبل",
    "مركز دراو"
];
//Bni Swaef
var Sweaf = [
    "الفشن",
    "الواسطى",
    "اهناسيا",
    "ببا",
    "بنى سويف",
    "سمسطا",
    "شريف باشا",
    "طلا",
    "قسم بنى سويف",
    "مدينة بنى سويف الجديدة",
    "ناصر"
];
//Asyut
var Asyut = [
    "ابنوب",
    "ابو تيج",
    "اسيوط",
    "البدارى",
    "الغنايم",
    "القوصيه",
    "النخيله",
    "اول اسيوط",
    "ثان اسيوط",
    "ديروط",
    "ساحل سليم",
    "صدفا",
    "مدينة أسيوط الجديدة",
    "مركز الفتح",
    "منفلوط"
];
//Luxor 
var Luxor = [
    "قسم الاقصر",
    "مركز أرمنت",
    "مركز ارمنت",
    "مركز اسنا",
    "مركز الاقصر",
    "مركز شرطة طيبة",
    "نجع الخطبه",
    "نجع حسان",
];
//New valey
var NewValey = [
   "الفرافره",
   "الواحات الخارجه",
   "الواحات الداخله",
];

//**************************************\\
function Show() {
    var x = document.getElementById("CompanyDetails");
    if (x.className.indexOf("w3-show") == -1) {
        x.className += " w3-show";
    } else {
        x.className = x.className.replace(" w3-show", "");
    }
};

function addTolist(Data) {
    $('#Address').children().remove();
    $.each(Data, function (i, item) {
        $('#Address').append($('<option>', {
            value: item,
            text: item
        }));
    });
}

function Condition(x) {
    if (x == 'مصر') {
        addTolist(Govs);
    }
    else if (x == 'محافظة كفر الشيخ') {
        addTolist(KFS)
    } else if (x == 'محافظة الدقهلية') {
        addTolist(Mansoura);
    } else if (x == 'محافظة الغربية') {
        addTolist(Tanta);
    } else if (x == 'محافظة البحيرة') {
        addTolist(AlBeheera)
    } else if (x == 'محافظة الإسكندرية') {
        addTolist(Alex)
    } else if (x == 'محافظة دمياط') {
        addTolist(Damita);
    } else if (x == 'محافظة المنوفية') {
        addTolist(Monofia);
    } else if (x == 'محافظة القاهرة') {
        addTolist(Cairo);
    } else if (x == 'محافظة الجيزة') {
        addTolist(Giza);
    } else if (x == 'محافظة المنيا') {
        addTolist(Menya);
    } else if (x == 'محافظة القليوبية') {
        addTolist(Elqlyubia);
    } else if (x == 'محافظة الشرقية') {
        addTolist(Elshrqya);
    } else if (x == 'محافظة الفيوم') {
        addTolist(Fayum);
    } else if (x == 'محافظة مطروح') {
        addTolist(Matroh);
    } else if (x == 'محافظة الإسماعيلية') {
        addTolist(Esmalia);
    } else if (x == 'محافظة بورسعيد') {
        addTolist(PortSaied);
    } else if (x == 'محافظة السويس') {
        addTolist(Swize);
    } else if (x == 'محافظة شمال سيناء') {
        addTolist(NorthCina);
    } else if (x == 'محافظة جنوب سيناء') {
        addTolist(SouthCina);
    } else if (x == 'محافظة سوهاج') {
        addTolist(Swhag);
    } else if (x == 'محافظة البحر الأحمر') {
        addTolist(ReadSea);
    } else if (x == 'محافظة قنا') {
        addTolist(Qna);
    } else if (x == 'محافظة أسوان') {
        addTolist(aswan);
    } else if (x == 'محافظة بني سويف') {
        addTolist(Sweaf);
    } else if (x == 'محافظة أسيوط') {
        addTolist(Asyut);
    } else if (x == 'محافظة الأقصر') {
        addTolist(Luxor);
    } else if (x == 'محافظة الوادي الجديد') {
        addTolist(NewValey);
    } else if (x == 'البرلس') {
        addTolist(Broles);
    } else if (x == 'الرياض') {
        addTolist(Ryad);
    } else if (x == 'الحاملول') {
        addTolist(Elhamol);
    } else if (x == 'الصوالحة') {
        addTolist(Sowalh);
    } else if (x == 'بيلا') {
        addTolist(byla);
    } else if (x == 'دسوق') {
        addTolist(Desouq);
    } else if (x == 'سيدى سالم') {
        addTolist(SidiSalm);
    } else if (x == 'فوه') {
        addTolist(فوه);
    } else if (x == 'شنو') {
        addTolist(Shno);
    } else if (x == 'قسم دسوق') {
        addTolist(QsmDesouq);
    } else if (x == 'قسم كفر الشيخ') {
        addTolist(قسم_كفر_الشيخ);
    } else if (x == 'قلين') {
        addTolist(Qlene);
    } else if (x == 'كفر الشيخ') {
        addTolist(KFSCity);
    } else if (x == 'مطوبس') {
        addTolist(motobs);
    } else {
        addTolist(null);
    }
}

function AddressShow() {
    var x = $("#Address :selected").text();
    var y = document.getElementById("Government").value;
    if (x !== "") {
        document.getElementById("Government").value = y + "-" + x;
        Condition(x);
    }
}

function AddressHidden() {
    var x = document.getElementById("Government").value;
    if (x === 'مصر') {
    } else if (x === '-مصر') {
    } else {
        var y = x.split('-');
        var data = "";
        var length = y.length - 1;
        for (var i = 0; i < length; i++) {
            if (y[i] !== "") {
                if (data === null) {
                    data = data + y[i];
                } else {
                    data = data + '-' + y[i];
                }
            }
        }
        document.getElementById("Government").value = data;
        Condition(y[length - 1]);
    }
}

function AddressGet() {
    var x = document.getElementById("Government").value;
    if (x === 'مصر') {
        Condition('مصر');
    } else if (x === '-مصر') {
        Condition('مصر');
    } else {
        var y = x.split('-');
        var data = "";
        var length = y.length - 1;
        Condition(y[length]);
    }
}

function SetDate() {
    var ssn = $('#SSN').val();
    var year = 0;
    var t1 = Number(ssn[1]);
    var t2 = Number(ssn[2]);
    var cn = Number(ssn[0]);
    if (cn === 2) {
        year = 1900 + t1 * 10 + t2;
    }
    else if (cn === 3) {
        year = 2000 + t1 * 10 + t2;
    }
    t1 = Number(ssn[3]);
    t2 = Number(ssn[4]);
    var month = t1 * 10 + t2;
    t1 = Number(ssn[5]);
    t2 = Number(ssn[6]);
    var day = t1 * 10 + t2;
    if (day < 10) {
        var day2 = "0" + day;
    } else {
        var day2 = day;
    }
    if (month < 10) {
        var month2 = "0" + month;
    } else {
        var month2 = month;
    }
    var date = year.toString() + '-' + month2 + '-' + day2;
    document.getElementById("Patient_DateOfBirth").value = date;
}